# ShouldStopOnError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomExporter..::..ShouldStopOnError Property
CustomExporter Class See Also
---
This flag instructs the exporting process to either stop or continue in case an error occurs during any of the exporting methods.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ShouldStopOnError { get; set; }
```

Visual Basic
---
```text
Public Property ShouldStopOnError As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShouldStopOnError {
	bool get ();
	void set (bool value);
}
```

# See Also
CustomExporter Class
Autodesk.Revit.DB Namespace